class FixXdcPayItems < ActiveRecord::Migration
  def change

    # shop_id = 5626
    # branch_id = 21339

    # execute <<-SQL
    #   select A.id, B.id, B.name
    #   from ddt_pay_items A inner join ddt_pay_methods B on B.deleted_at is not null
    #   where A.branch_id = 21339
    #   and A.paid_at between '2016-03-18 00:00:00' and '2016-03-18 23:59:59'
    #   and A.pay_method_id = B.id;
    # SQL

    # A.id     B.id   B.name
    # 1337680  54724  30消费券
    # 1337678  54787  美团套餐89

    # select id, name, deleted_at from ddt_pay_methods where shop_id = 5626 and name in ('30消费券' , '美团套餐89');

    # id    | name           | deleted_at          |
    # +-------+----------------+---------------------+
    # | 54724 | 30消费券       | 2015-12-31 23:30:18 |
    # | 54787 | 美团套餐89     | 2015-12-31 23:35:52 |
    # | 55213 | 30消费券       | NULL                |
    # | 55222 | 美团套餐89     | 2016-01-01 00:13:01 |
    # | 55245 | 美团套餐89     | NULL

    # 54724 -> 55213
    # 54787 -> 55245

    # pay_method_id pay_method_name pay_method_name_sym pay_method_code
    # +---------+---------------+-----------------+---------------------+-----------------+------------------------------+
    # | id      | pay_method_id | pay_method_name | pay_method_name_sym | pay_method_code | pay_method_percent_of_actual |
    #     +---------+---------------+-----------------+---------------------+-----------------+------------------------------+
    # | 1337678 |         54787 | 美团套餐89      | NULL                | 5102208         |                          100 |
    # | 1337680 |         54724 | 30消费券        | NULL                | 5101020         |                          100 |
    #     +---------+---------------+-----------------+---------------------+-----------------+------------------------------+

    # +-------+---------+----------------+----------+-----------+---------+---------+--------+---------------------+---------------------+---------------------+-------------------+
    # | id    | shop_id | name           | name_sym | name_abbr | code    | builtin | enable | created_at          | updated_at          | deleted_at          | percent_of_actual |
    #     +-------+---------+----------------+----------+-----------+---------+---------+--------+---------------------+---------------------+---------------------+-------------------+
    # | 54724 |    5626 | 30消费券       | NULL     | 30xfq     | 5101020 |       0 |      1 | 2015-12-29 10:58:17 | 2015-12-31 23:30:18 | 2015-12-31 23:30:18 |               100 |
    # | 54787 |    5626 | 美团套餐89     | NULL     | mttc89    | 5102208 |       0 |      1 | 2015-12-29 13:38:40 | 2015-12-31 23:35:52 | 2015-12-31 23:35:52 |               100 |
    # | 55213 |    5626 | 30消费券       | NULL     | 30xfq     | 5101020 |       0 |      1 | 2015-12-31 23:45:03 | 2015-12-31 23:45:03 | NULL                |                 0 |
    # | 55245 |    5626 | 美团套餐89     | NULL     | mttc89    | 5102208 |       0 |      1 | 2016-01-01 00:22:25 | 2016-01-01 00:22:25 | NULL                |               100 |
    #     +-------+---------+----------------+----------+-----------+---------+---------+--------+---------------------+---------------------+---------------------+-------------------+

    execute <<-SQL
      update ddt_pay_items
      set pay_method_id = 55213, pay_method_percent_of_actual = 0
      where id = 1337680
    SQL

    execute <<-SQL
      update ddt_pay_items
      set pay_method_id = 55245, pay_method_percent_of_actual = 100
      where id = 1337678
    SQL


  end
end
